{
  "-NPJpykQLhV3Tg0kzwBZ": {
    "firebaseKey": "-NPJpykQLhV3Tg0kzwBZ",
    "category_id": "-NPJo5h0ZWmQv25p9G1i",
    "creator_id": "-NPK-SY4-4R-EjnpDCF5",
    "title": "Hemming Jeans",
    "description": "How to hem your jeans to look like the original hem",
    "image": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-jeans-hem-1024x683.jpg",
    "created_by": "Rebecca Harrison",
    "video": "",
    "timestamp": "2/1/2023, 6:33:49 AM",
    "favorite": false,
    "stepone": "Start by trying on the jeans that you plan to hem. On one of the legs, fold the hem up to the right side to the height you want your finished hem at. Make sure to stand up straight and evaluate the hem before deciding you're happy with it - the hem will look different when bent over than when you're standing straight! Once you like the location of the folded hem, pin it in place with a couple of sewing pins. Then, take the pants off and bring them to your sewing table.",
    "imageone": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-pin-pantleg.jpg",
    "steptwo": "Using a fabric pen or chalk, mark the right side of the pantleg at the center of the fold.",
    "imagetwo": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-mark-pantleg.jpg",
    "stepthree": "Next, lay the marked pantleg flat, carefully aligning the back and front hems and the side seams.",
    "imagethree": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-jean-hem-marked.jpg",
    "stepfour": "On the marked pantleg, measure how far up from the current hem your mark is at. Then, mark around the entire pantleg at that same height. Use your ruler to measure up from the hem to get your line at the right height.",
    "imagefour": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-measure-hem-marking-on-jeans.jpg",
    "stepfive": "Next, draw another straight line around the pantleg 1/2 inch above your first line.",
    "imagefive": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-draw-second-line-on-pantleg.jpg",
    "stepsix": "For straight leg jeans, start by folding the hem of each pantleg up to the right side, matching the folded topstitched edge of the hem with the upper marked line on the pant. Pin the hem in place on both pantlegs.",
    "imagesix": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-pin-second-hem.jpg",
    "stepseven": "Now it's time to start sewing! Put a zipper foot on your sewing machine so that the needle is to the left of the foot. Thread your machine with all-purpose thread and use a denim needle. If your sewing machine has this capability, move the needle to the far left edge of the foot. The closer you can get the stitching to the original hem, the more professional your hem will look.",
    "imageseven": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-move-needle-left.jpg",
    "stepeight": "Next, place the first hem under the foot, lining up the original hem along the left edge of the zipper foot. Sew around the entire hem, stitching as close to the original hem as possible and making sure to backstitch at the beginning and end.",
    "imageeight": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-start-sewing-hem.jpg",
    "stepnine": "Trim your thread tails, then repeat the process to sew the second hem in place. Trim the excess fabric to 1/2 inch. Your hem is now sewn! But there's still excess fabric inside the pantleg that needs to be dealt with before you can wear your freshly hemmed jeans. Trim the top layer of the seam allowance to 1/4 inch.",
    "imagenine": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-trim-inner-seam-allowance.jpg",
    "stepten": "Then, seam rip all of the original topstitching from the hem to completely open up the folds of the hem. If you're sewing wide or tapered leg jeans, some of the topstitching will already be removed around the inseam or outer leg seam. Press both layers of the seam allowance down into the unfolded hem with your iron. To remove bulk, trim the side seam and inseam out of the seam allowance, trimming close to your stitching, but being careful not to cut through your seam. Fold the original hem back into place, folding it over your trimmed seam allowance to enclose the raw edges inside. Pin the it in place on both pantlegs. Then, stitch around the hems, sewing within the original topstitching lines. I like to use topstitching thread for this to make it look really professional. Give your freshly hemmed jeans a final pressing with lots of steam and you're done! Enjoy a perfectly fitting pair of jeans!",
    "imageten": "https://sweetredpoppy.com/wp-content/uploads/2022/06/How-to-Hem-Jeans-hem-topstitched.jpg",
    "uid": "MhW622Ow3rNYv0tNqA6KVV6p7A53"
  },
  "-NPJpykVM0JW8YfBIWMr": {
    "firebaseKey": "-NPJpykVM0JW8YfBIWMr",
    "category_id": "-NPJo5h0ZWmQv25p9G1i",
    "creator_id": "-NPK-SY4-4R-EjnpDCF5",
    "title": "Button Repair",
    "description": "How to reattach a button",
    "image": "https://d2culxnxbccemt.cloudfront.net/craft/content/uploads/2014/11/25110423/download-2020-08-25T100417.015.jpeg",
    "created_by": "Rebecca Harrison",
    "video": "",
    "timestamp": "2/2/2023, 9:14:12 PM",
    "favorite": false,
    "stepone": "Thread your needle and tie a knot at the end. I always use way more thread than I think I need, just to avoid having to rethread and knot another piece in case I run out in the middle of the task. You'll also want to pick out a color that's the same or a close match to the one on your shirt, pants, skirt, what have you so your handiwork doesn't stand out. Another thing before you start? Make sure the button is on the right side! The flat part should be against the fabric, and the side with the ridge should be facing up.",
    "imageone": "https://content.artofmanliness.com/uploads/2012/06/double-thread.jpg",
    "steptwo": "Create Anchor “X” Point. Starting at the back end of the fabric, run the needle through to the front where the button is going to be needed.  Run the thread through to the back, and then again back to the front.  You want to create a small “X” where the button will be centered.  This X is also the reinforced anchor for the thread to ensure it doesn’t loosen during stress.",
    "imagetwo": "https://content.artofmanliness.com/uploads/2012/06/Anchor.jpg",
    "stepthree": "Position the Button. Put the button on the anchor “X” and begin sewing by pushing the needle from the back to the front through the first button hole. At this point you want to add the spacer (a second needle or a toothpick, pin, or small stick can be used). Push the needle up from the underside of the garment and through one of the holes on the button. Pull the thread all the way through until the knot snugs against the underside of the fabric. Use a fingertip to keep the button in its place. You’ll repeat this process for six passes, three for each set of holes on the button.",
    "imagethree": "https://content.artofmanliness.com/uploads//2012/06/first-pass.jpg",
    "stepfour": "Create the Shank. On your last repetition of the previous step, come back up through the fabric but not through the button. Come up like you were going to go through the usual hole in the button, but turn the needle aside and bring it out from underneath the button. Use the needle to wrap your thread around the threads beneath the button. Make six loops around the bridges of thread that connect the button to the fabric, behind the button itself. Pull tight and then dive the needle back into the base to be tied off on the other side of the fabric.",
    "imagefour": "https://content.artofmanliness.com/uploads//2012/06/shank3.jpg",
    "stepfive": "Tie It Off. Make a small knot on the back side of the fabric. You can use the needle to guide the thread through a knot or you can snip the thread off the needle and tie the knot in the slack with your fingers, but either way you want it snug up against the back of the fabric. Probably the easiest knot to tie off is a simple overhand loop tied with the needle still attached. Pin the thread down right against the back of the fabric, under the button, then make a little circle in the thread just beyond your fingertip and pass the needle through the circle. Tighten it down and then cut off the excess fabric.",
    "imagefive": "https://content.artofmanliness.com/uploads/2012/06/final-tie-off2.jpg",
    "stepsix": "Trim the excess thread with scissors or a seam ripper.",
    "imagesix": "https://content.artofmanliness.com/uploads/2012/06/final-cut-off.jpg",
    "uid": "MhW622Ow3rNYv0tNqA6KVV6p7A53"
  },
  "-NPJpyk_tdW85GQq7FE9": {
    "firebaseKey": "-NPJpyk_tdW85GQq7FE9",
    "category_id": "-NPJo5h0ZWmQv25p9G1i",
    "creator_id": "-NPK-SY4-4R-EjnpDCF5",
    "title": "Sashiko",
    "description": "How to mend your clothes with visible mending technique, Sashiko",
    "image": "https://cdn.vox-cdn.com/thumbor/t8pxS0VwfS2MRmWXsGEZxdPvzbI=/0x0:2000x2000/1200x800/filters:focal(877x1061:1197x1381)/cdn.vox-cdn.com/uploads/chorus_image/image/63282239/jessica_marquez_sashiko_mending_2918.0.jpg",
    "created_by": "Rebecca Harrison",
    "video": "",
    "timestamp": "2/10/2023, 3:45:19 PM",
    "favorite": false,
    "stepone": "Cut a patch of fabric that covers the hole and a few centimetres around the edge. Optionally, you can overcast the edges of the patches as I did, to stop them fraying. If your sewing machine doesn’t have an overcast stitch, you could use a zigzag stitch, cut the edges with pinking shears, or even leave them raw (as the raw edges will be hidden inside the garment).",
    "imageone": "https://images.squarespace-cdn.com/content/v1/5ccde55965a707021eaa651e/1557742213316-YVUTI0T4KGVF2OMXSEFN/IOV_4896.jpg?format=1000w",
    "steptwo": "Pin the patch to the reverse of the garment, centred over the hole. I started off using pins, but safety pins work slightly better as they’re less likely to move. Flip the garment right side out again. At this point, you may want to mark the right side with chalk to indicate where the patch is on the inside, but this isn't essential.",
    "imagetwo": "https://images.squarespace-cdn.com/content/v1/5ccde55965a707021eaa651e/1557261832478-VJXS5KGB1E7QR4RR7SV0/IOV_4904.jpg?format=2500w",
    "stepthree": "Thread your needle and knot the end of the thread. Starting on the inside of the garment, in an area where the garment is still intact (i.e. not where the hole is!) bring the needle up through the patch and fabric to the right side, then tug the thread to bring the knot between the patch and the garment fabric. You’re ready to start stitching, Japanese style!",
    "imagethree": "https://images.squarespace-cdn.com/content/v1/5ccde55965a707021eaa651e/1557261833978-NHL7MKM9VPARDF2AOYQ5/IOV_4914.jpg?format=1000w",
    "stepfour": "Bring the needle down and up through the fabric several times, until you have your needle loaded, then pull the needle through to create your stitches. Loading the needle like this is part of the tradition of sashiko and helps to create even stitches.",
    "imagefour": "https://images.squarespace-cdn.com/content/v1/5ccde55965a707021eaa651e/1557742481304-MX9GL5QXUDC8FNS95K4A/IOV_4913-2.jpg?format=1000w",
    "stepfive": "Continue like this until your design is complete. Feel free to get as creative as you like! Pinterest is a great resource for inspiration. Note, if you want to create crosses like I did, the best way is to create all the horizontal stitches first and then go back and create all the vertical stitches",
    "imagefive": "https://images.squarespace-cdn.com/content/v1/5ccde55965a707021eaa651e/1557261834177-ZKXYR7OM4CJ192QDPMAP/IOV_4923.jpg?format=2500w",
    "uid": "MhW622Ow3rNYv0tNqA6KVV6p7A53"
  },
  "-NPJpykeKxTj1nU7ukJu": {
    "firebaseKey": "-NPJpykeKxTj1nU7ukJu",
    "category_id": "-NPJo5h1A4COa5ExIPZV",
    "creator_id": "-NPK-SY79RXiwEsgTpMY",
    "title": "Install Bathroom Faucet",
    "description": "How to install a bathroom faucet",
    "image": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-4.jpg",
    "created_by": "Rob Kenney",
    "video": "",
    "timestamp": "2/15/2023, 12:45:19 PM",
    "favorite": false,
    "stepone": "Before installing a bath faucet, find the right one for you and your needs. Sinks with 3 holes that measure 4 inches between holes should use a centerset faucet. Alternatively, choose a single-hole faucet with a deck plate to cover the vacant holes. Faucets for this type of configuration have the spout, handles, valves and mixing tee within the fixture. When the sink (or vanity top) holes measure 8 inches apart between holes, consider a widespread faucet. This type has one handle and valve for cold water and one handle and valve for hot water. The mixing tee is installed separately beneath the spout. You may also want to consider a faucet with energy-saving features. If conserving water is a factor in your lifestyle, look for Water sense labeled models. The new faucet will come with the parts needed for installation, except for the lines used to connect the valves to the water supply. Unless you are replacing an existing wall-mounted faucet, this type of faucet will require rerouting plumbing behind the wall.",
    "imageone": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-1.jpg",
    "steptwo": "When beginning bathroom sink faucet installation, remove all items from under the sink. Place a bucket, pan or rags under the work area to catch any water from disconnected lines. Turn off the hot- and cold-water supply lines at the shut-off valves beneath the sink. If there are no shut-off valves, turn off the main water supply. Turn the faucet on to release pressure in the water lines and let drip until empty. Tip: To make installing a bath faucet safer and more comfortable, use towels to cushion your back and wear eye protection.",
    "imagetwo": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-2.jpg",
    "stepthree": "Use an adjustable wrench to disconnect the water supply lines. Remove the faucet mounting nuts from underneath the sink, using a basin wrench for hard-to-reach areas. Use a penetrating lubricant for any stubborn nuts that have corrosion. Unhook the lift rod for the drain stopper. When disconnected, lift the faucet fixture from the top of the sink. Use a putty knife, if needed, to assist prying the old faucet from the old sealant or gasket. Scrape the remaining sealant remnants from the sink surface. Clean the surface around the holes with a cleaner appropriate for your sink type. Mineral spirits or rubbing alcohol can be used to remove sealant residue. Tip: Some bathroom sink faucets include a matching drain collar around the drain hole. Use tongue-and-groove pliers to remove the old collar. Unscrew it from the drain rim beneath the sink after disconnecting the P-trap.",
    "imagethree": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-3.jpg",
    "stepfour": "Note: When learning how to install a bathroom faucet or change a bathroom sink faucet, always use the instructions enclosed with your particular faucet, as specific steps can vary between models. Assemble the faucet following the manufacturer’s instructions. Apply a bead of plumber’s putty or silicone caulk around the bottom of the faucet or the faucet holes on top of the sink, if called for in your instructions. Place the faucet gasket over the tailpieces so that it is between the sink and the base of the faucet. Insert the faucet assembly into the mounting holes so that the base is parallel to the back of the sink, and press the faucet down firmly into the sealant.",
    "imagefour": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-4.jpg",
    "stepfive": "Thread a washer and basin nut onto the valve tailpieces from underneath the sink. Tighten the nuts, alternating from one side to the other, to draw the faucet body evenly over the gasket. Do not tighten all the way.",
    "imagefive": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-5.jpg",
    "stepsix": "Measure from both sides of the faucet body and adjust as necessary so that it's centered on the top of the bathroom sink.",
    "imagesix": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-6.jpg",
    "stepseven": "From beneath the sink, tighten the mounting nuts to keep the faucet in place. Use a basin wrench or a sink installer tool, being careful to not over-tighten the nuts. Wipe away any excess putty from around the faucet base. Apply clear silicone to the underside of the drain collar.Screw it into place on the drain rim. Wipe away excess silicone. Install pop-up stopper and its lift rod according to the manufacturer’s instructions.",
    "imageseven": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-7.jpg",
    "stepeight": "Attach the supply lines to the faucet. Tighten (but not over-tighten) using an adjustable wrench. Turn the water back on at the supply line valves. Remove the aerator on the spout.Turn on the faucet and allow both hot and cold water to flush the system for one minute. Check for leaks. Replace the aerator.",
    "imageeight": "https://contentgrid.homedepot-static.com/hdus/en_US/DTCCOMNEW/Articles/how-to-install-a-bathroom-faucet-step-8.jpg",
    "uid": "zAIU0rIVbbUbE6kzYeoTUqty7Eb2"
  },
  "-NPJpykjSz4nW1hR_CVe": {
    "firebaseKey": "-NPJpykjSz4nW1hR_CVe",
    "category_id": "-NPJo5h3B784ca-gur9M",
    "creator_id": "-NPK-SYACCbEKHdw4xPG",
    "title": "Replace Headlight",
    "description": "How to replace your car headlights",
    "image": "https://www.liveabout.com/thmb/T8RTpSLJWFuT6akCi6xtaWiYzUY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/86736487-56a056335f9b58eba4afef6c-59dbd04c054ad90010ba3060.jpg",
    "created_by": "Jon Morgan",
    "video": "",
    "timestamp": "2/28/2023, 10:45:19 AM",
    "favorite": false,
    "stepone": "If your vehicle has removable headlight bulbs, remove the protective shield from the back of the headlight assembly (if there is one), then turn and loosen the plastic harness containing the bulb.",
    "imageone": "https://shop.advanceautoparts.com/r/sites/default/files/2017-07/Headlight%20Replace%20Step%201.jpg",
    "steptwo": "Slide the plastic harness and headlight bulb from the headlight assembly’s back.",
    "imagetwo": "https://shop.advanceautoparts.com/r/sites/default/files/2017-07/Headlight%20Replace%20Step%201A.jpg",
    "stepthree": "Remove the clip that holds the bulb in the headlight assembly, and carefully remove the headlight from the harness.",
    "imagethree": "https://shop.advanceautoparts.com/r/sites/default/files/2017-07/Headlight_Replace_Step_3B%5B1%5D.jpg",
    "stepfour": "Wearing a cotton glove, carefully insert the new bulb into the harness.",
    "imagefour": "https://shop.advanceautoparts.com/r/sites/default/files/Headlight%20Replace%20Step%204.jpg",
    "stepfive": "Reinstall the clip that secures the bulb in the harness and push the harness into the back of the headlight. Twist it into place so it locks. Turn on the headlights to make sure they're working.",
    "imagefive": "https://shop.advanceautoparts.com/r/sites/default/files/Headlight_Replace_Step_6%5B1%5D.jpg",
    "uid": "CR6sllPjE0crpYX0lua8LSAMFSB3"
  }
}
